# Задача №17. Решение в группах
# Дан список чисел. Определите, сколько в нем
# встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6

numbers = []
for i in range(int(input())):
    numbers.append(input())
    
print(len(set(numbers)))
